{
    "entries": [
        {
            "type": "project",
            "title": "Python for Data and Physics",
            "category": "programming",
            "tag": "Python",
            "status": "In Progress",
            "institution": "Self-study / Online",
            "term": "Spring 2026",
            "description": "Learning Python alongside physics courses for data entry, plotting, and simulations.",
            "content": "<blockquote><strong>I ain't reading all that:</strong> I’m teaching myself Python to stop doing math by hand. I’m using libraries like NumPy and Matplotlib to turn physics formulas into interactive simulations. It feels like finally getting a superpower that makes my homework actually look cool and move in real-time.</blockquote><h4>The Vision: From Notebooks to Numerical Models</h4><p>In the world of undergraduate physics, there is a traditional 'rite of passage' involving endless sheets of notebook paper and the constant fear of a carried-over minus sign ruining a three-hour calculation. My 'Python for Data and Physics' project is my personal transition from being a student who calculates to a researcher who simulates. Python has become the lingua franca of the scientific community because it is expressive and allows for 'rapid prototyping' of physical theories.</p><h4>The Technical Toolkit</h4><p>I am mastering the 'scientific stack'—specifically <strong>NumPy</strong> for high-performance numerical arrays and <strong>Matplotlib</strong> for visualization. NumPy allows me to perform calculations on entire arrays of time steps simultaneously, which is essential for modeling complex systems.  Beyond simple plotting, I am exploring <strong>SciPy</strong> for advanced integration and optimization, which helps me find the 'best fit' for noisy experimental data gathered in my UTSA labs.</p><h4>The Math of Motion</h4><p>A major focus this semester is the <strong>Euler-Cromer method</strong> of numerical integration. I am building simulations that model planetary orbits and simple harmonic motion. By breaking time into tiny 'steps,' I can calculate how a system evolves over hours or years in just a few seconds of compute time. This has fundamentally changed how I view my coursework; gravity is no longer just a constant in a textbook, but a vector field that I can manipulate in my code.</p><h4>Reflections and Future Goals</h4><p>There is a specific kind of 'Aha!' moment that happens when you write twenty lines of code and see a wave function evolve across your screen exactly as described. It feels like I’ve stopped looking at the map and finally started driving the car. Moving forward, I aim to build a fully functional 'Physics Dashboard' that takes raw CSV data and generates publication-ready analysis reports automatically.</p>",
            "gradient": "from-blue-400 to-green-500",
            "icon": "fas fa-code"
        },
        {
            "type": "experience",
            "title": "RYLA Leadership Camp Participation",
            "category": "leadership",
            "tag": "Youth Leadership",
            "status": "Completed",
            "institution": "RYLA",
            "term": "Summer 2024",
            "description": "Attended leadership camp and engaged in teamwork and personal development exercises.",
            "content": "<blockquote><strong>I ain't reading all that:</strong> I went to a Rotary leadership camp where they put us through intense team challenges. It wasn't just 'feel good' stuff; it taught me how to actually manage people and stay calm when things go wrong. I feel way more confident leading a lab group now.</blockquote><h4>The Social Physics of Leadership</h4><p>Science is rarely a solo sport. The quality of a lab's output is often limited by the quality of the team's coordination. This is why I pursued the <strong>Rotary Youth Leadership Awards (RYLA)</strong>. This intensive program drops students into the 'crucible of leadership' to test their resilience and communication styles under pressure.</p><h4>The Crucible: Experiential Learning</h4><p>RYLA isn't about taking notes; it's about action. We were tasked with complex physical puzzles—like building structures with limited resources under strict time constraints. These activities are designed to trigger stress, which is where true leadership emerges.  I learned that a team has its own kind of inertia. If you push too hard without building trust, the friction increases and the project stalls.</p><h4>The Servant Leadership Model</h4><p>The most profound lesson was the shift toward 'Servant Leadership.' In this model, the leader's job is to remove obstacles so the rest of the team can shine. I realized that delegating isn't about dumping work; it’s about empowerment. This has changed how I approach group projects at UTSA, where I now spend more time listening and ensuring every member has the resources they need to succeed.</p><h4>Long-term Impact</h4><p>I feel a sense of relief after this experience. Before RYLA, I felt I had to do everything myself. Now, I understand that clear communication is the antidote to project failure. It has made my academic life significantly more collaborative and less stressful, allowing me to focus on high-level strategy rather than micromanagement.</p>",
            "gradient": "from-green-300 to-blue-400",
            "icon": "fas fa-users"
        },
        {
            "type": "certificate",
            "title": "Microsoft Python Developer Professional Certificate",
            "category": "programming",
            "tag": "Professional Dev",
            "status": "In Progress",
            "institution": "Coursera / Microsoft",
            "term": "2026",
            "description": "Professional certificate in Python development covering programming fundamentals and automation.",
            "content": "<blockquote><strong>I ain't reading all that:</strong> I'm getting a pro certification from Microsoft to prove I can build full websites and manage code on GitHub like a professional engineer. It makes me feel like I’m moving from a student who codes to an actual software developer ready for a real job.</blockquote><h4>Professionalizing the Codebase</h4><p>There is a massive difference between writing a script that works on your laptop and building software that thousands of people can use. My journey through the <strong>Microsoft Python Developer Professional Certificate</strong> is about crossing that bridge. This isn't just about syntax; it's about <strong>Software Engineering</strong>—the art of building robust, scalable applications.</p><h4>The Developer's Toolbelt</h4><p>The curriculum covers the full <strong>Software Development Lifecycle (SDLC)</strong>.  I am currently deep-diving into <strong>Django and Flask</strong> to power web back-ends, and learning the professional way to use <strong>Git and GitHub</strong>. Moving from saving files as 'version_1' to using pull requests and branching has been a revelation for my workflow.</p><h4>AI-Powered Development</h4><p>A key focus of this certification is the integration of <strong>Generative AI</strong> into the developer workflow. We are learning to use AI as a pair-programmer to speed up debugging and boilerplate generation. This represents the future of the industry, and staying ahead of that curve is vital for any modern developer.</p><h4>Legitimacy and Confidence</h4><p>Following a curriculum designed by Microsoft engineers gives me a blueprint for excellence. Every time I pass a module involving complex database integration or cloud deployment, I feel my 'imposter syndrome' fade. It is hard work, but the satisfaction of a 'Build Succeeded' message is a high that never gets old. It positions me perfectly for a career in computational physics or software engineering.</p>",
            "gradient": "from-blue-600 to-indigo-700",
            "icon": "fab fa-microsoft"
        },
        {
            "type": "certificate",
            "title": "Adobe Graphic Designer Professional Certificate",
            "category": "leadership",
            "tag": "Design",
            "status": "In Progress",
            "institution": "Coursera / Adobe",
            "term": "2026",
            "description": "Learn design fundamentals, image editing, and portfolio-ready projects using Adobe tools.",
            "content": "<blockquote><strong>I ain't reading all that:</strong> I'm learning pro Adobe tools (Photoshop, Illustrator) to make my research and projects look amazing. It’s not just about 'art'—it's about using design and AI to communicate complex ideas clearly. It’s a great creative break from heavy math.</blockquote><h4>The Science of Visual Communication</h4><p>Why would a Physics major study Graphic Design? Because the greatest discovery is useless if no one understands it. Design is the bridge between raw data and human understanding. This <strong>Adobe Professional Certificate</strong> is my path to mastering that bridge.</p><h4>Mastery of the Suite</h4><p>The program is a masterclass in the 'Big Three': <strong>Photoshop</strong> for image manipulation, <strong>Illustrator</strong> for vector graphics, and <strong>InDesign</strong> for layout.  I am also learning to use <strong>Adobe Firefly</strong>, an AI engine that allows for rapid iteration on visual concepts while maintaining high standards of originality.</p><h4>Visual Hierarchy in Research</h4><p>Applying these principles to my academic work has been a game-changer. When designing a research poster, I am no longer just throwing text onto a slide. I am thinking about <strong>Visual Hierarchy</strong>—guiding the viewer's eye from the hypothesis to the results using color theory and typography. This ensures my work is readable and impactful at conferences.</p><h4>Creative Balance</h4><p>I feel a strange sense of peace when working in Illustrator. It is a different kind of problem-solving. In math, there is one right answer; in design, there are infinite answers, and your job is to find the most <em>effective</em> one. It keeps me from burning out on formulas and makes me a more 'complete' thinker—someone who can calculate the stars and also paint them.</p>",
            "gradient": "from-red-500 to-orange-500",
            "icon": "fab fa-adobe"
        },
        {
            "type": "certificate",
            "title": "Microsoft Public Relations Associate Certificate",
            "category": "leadership",
            "tag": "Business",
            "status": "In Progress",
            "institution": "Coursera / Microsoft",
            "term": "2026",
            "description": "Professional certificate for public relations and communications, covering media relations and crisis management.",
            "content": "<blockquote><strong>I ain't reading all that:</strong> I’m learning the business side of PR—how to handle media, write press releases, and manage a brand's reputation. I want to be able to explain science to the public without it being boring. It helps me be a professional 'voice' for science.</blockquote><h4>Engineering the Narrative</h4><p>In an era of complex global challenges, the ability to communicate clearly and ethically is critical. The <strong>Microsoft PR and Communications Associate</strong> certificate is about the strategic side of messaging. It moves into the realm of <strong>Integrated Communications</strong>, where every message is part of a purposeful narrative.</p><h4>Frameworks and Crisis Management</h4><p>The curriculum covers <strong>Media Relations</strong> and <strong>Crisis Communication</strong>. In Crisis Comm, you learn how to respond when a project fails or a company makes a mistake.  You learn the importance of transparency, speed, and accountability—frameworks used by the world's largest organizations to maintain public trust.</p><h4>Data-Driven Communication</h4><p>I am learning how to use analytics to track the 'sentiment' of a campaign. It’s not just about sending a tweet; it’s about understanding who it reached and how it changed their perception. This 'data-driven' approach appeals to the mathematician in me, as it allows for the measurement of something as abstract as reputation.</p><h4>A Voice for Science</h4><p>This is the 'missing link' in my education. Many scientists are brilliant but can't explain their work to the public or a politician. I feel a responsibility to be different. This course prepares me to advocate for research funding and explain breakthroughs to the general public. Every case study I analyze makes my world-view expand, teaching me to be not just a scientist, but an advocate for science.</p>",
            "gradient": "from-indigo-400 to-purple-600",
            "icon": "fas fa-bullhorn"
        },
        {
            "type": "experience",
            "title": "Interact Club @ Comfort HS",
            "category": "leadership",
            "tag": "Founding President",
            "status": "Completed",
            "institution": "Rotary International",
            "term": "2023 - 2025",
            "description": "Founded the inaugural club at Comfort High School. Recruited 30+ members and established sustainable community service projects.",
            "content": "<blockquote><strong>I ain't reading all that:</strong> I started a Rotary-affiliated club from scratch in high school. I grew it to 30 people and led a bunch of community service events. It taught me how to build an organization from zero and why 'Service Above Self' is a lifestyle, not just a slogan.</blockquote><h4>The Genesis: Building from Zero</h4><p>In a small community like Comfort, Texas, the impulse to help is always present, but the infrastructure to do so effectively is often missing. During my sophomore year, I recognized a gap in our high school’s extracurricular landscape: there was no dedicated organization for consistent, structured community service. I decided to fill that gap by founding the <strong>Comfort High School Interact Club</strong>. Starting an organization from the ground up is a lesson in 'Social Physics'—you have to generate enough initial force to overcome the static friction of 'the way things have always been done.'</p><h4>Navigating the Bureaucracy</h4><p>The process was my first real-world introduction to organizational management. I didn't just need a group of friends; I needed a blueprint. This involved presenting a formal proposal to the school board, securing a faculty advisor, and, most importantly, establishing a partnership with our sponsoring <strong>Rotary Club of Kerrville</strong>. Learning to speak the language of professional adults—discussing bylaws, membership dues, and liability—prepared me for the professional world far more than any standard classroom lecture could.</p><h4>Recruitment and Cultural Momentum</h4><p>A club is only as strong as its members. I launched a recruitment campaign that focused on the 'Why' rather than the 'What.' Instead of telling people we were going to pick up trash, I told them we were going to take ownership of our town's future. Within months, we grew to over 30 active members. I learned that leadership isn't about being the loudest person in the room; it’s about creating a space where thirty other people feel empowered to contribute their own ideas. We implemented a 'Legacy' system, ensuring that younger members held junior officer positions so the club wouldn't vanish after I graduated.</p><h4>The Impact: Local and Global</h4><p>Under my presidency, we tackled projects that ranged from local park restoration to supporting Rotary’s global initiative to <strong>End Polio Now</strong>. We organized a community-wide fundraiser that not only raised significant capital for international health but also raised awareness within our small town.  This taught me the importance of the 'Four-Way Test' used by Rotarians: Is it the truth? Is it fair to all concerned? Will it build goodwill? Will it be beneficial? These principles now guide my academic and professional ethics.</p><h4>Reflections on 'Service Above Self'</h4><p>Looking back, the Interact Club was my 'Foundational Project.' It taught me that if you want to see a change in your environment, you can’t wait for someone else to build the container for that change. You have to build it yourself. As I transition into more complex physics research and academic pursuits, I carry the realization that even the most technical work must eventually serve the community.</p>",
            "gradient": "from-fuchsia-500 to-purple-600",
            "icon": "fas fa-hands-bound"
        },
        {
            "type": "experience",
            "title": "VOICES @ UTSA",
            "category": "leadership",
            "tag": "Active Member",
            "status": "In Progress",
            "institution": "UTSA",
            "term": "2025 - Present",
            "description": "Dedicated member contributing to diverse service initiatives across San Antonio, focusing on community outreach.",
            "content": "<blockquote><strong>I ain't reading all that:</strong> I'm an active volunteer at UTSA. I help out with different service projects around San Antonio. It keeps me connected to the community outside of just doing homework. It’s service with a purpose.</blockquote><h4>The Transition to University Service</h4><p>When I arrived at the University of Texas at San Antonio, I knew I wanted to continue the service journey I started in high school. I joined <strong>VOICES (Volunteer Organization Involving Community, Education, and Service)</strong>, which is one of the most active student organizations on campus. Transitioning from being the 'Founder' of a small club to a 'Member' of a massive university organization gave me a new perspective on leadership: sometimes the best way to lead is by being a highly reliable and enthusiastic contributor to a larger machine.</p><h4>San Antonio as a Classroom</h4><p>VOICES has allowed me to see San Antonio through a lens that many students miss. We don't just stay on the 'UTSA Bubble'; we go where the need is. Whether it’s sorting thousands of pounds of produce at the <strong>San Antonio Food Bank</strong> or helping with urban reforestation projects, these experiences have been a vital counterweight to my academic life.  While my physics courses deal with the abstract laws of the universe, VOICES deals with the immediate, tangible needs of my neighbors.</p><h4>The Logistics of Impact</h4><p>Participating in such a wide variety of service projects has taught me about <strong>Social Logistics</strong>. Seeing how an organization like the Food Bank manages thousands of volunteers and millions of pounds of inventory is a masterclass in efficiency. I’ve started to see parallels between the entropy I study in physics and the 'social entropy' that occurs in a city. Service is the energy we put into the system to keep it organized and healthy. I’ve become particularly interested in how data and efficiency can improve the way we distribute resources to those in need.</p><h4>Building Community in the Crowds</h4><p>One of the highlights of my time with VOICES was being recognized with the <strong>Most Spirited Award</strong>. To me, this wasn't just about being 'loud'—it was about maintaining morale during a six-hour shift in the Texas heat. Leadership is often about managing the energy of the group. If the leader or a senior member is tired and complaining, the whole team slows down. If you maintain enthusiasm, the work feels lighter for everyone. It’s a lesson I apply to my lab groups at UTSA: a positive culture is a functional advantage.</p><h4>Future Outlook: The Citizen Scientist</h4><p>Being an active member of VOICES ensures that I don't become an 'ivory tower' scientist. I want my future career in research to be informed by the real-world challenges I see in San Antonio. Whether I’m developing new technologies or teaching physics, I want my work to be accessible and beneficial to the community that supported me during my undergraduate years.</p>",
            "gradient": "from-orange-400 to-red-500",
            "icon": "fas fa-hand-holding-heart"
        },
        {
            "type": "experience",
            "title": "LeaderShape Institute",
            "category": "leadership",
            "tag": "Graduate",
            "status": "Completed",
            "institution": "UTSA Leadership & Service",
            "term": "Summer 2025",
            "description": "Completed an intensive leadership development program focused on ethical leadership and creating a vision for the future.",
            "content": "<blockquote><strong>I ain't reading all that:</strong> I spent a week at an intense leadership retreat that totally changed my perspective. I stopped thinking about leadership as 'being the boss' and started thinking about it as 'creating a vision.' My vision is to make high-level science education accessible to kids in rural towns like mine.</blockquote><h4>The Crucible of Leadership</h4><p>In the summer of 2025, I was selected to attend the <strong>LeaderShape Institute</strong>, an intensive six-day residential program designed to help students explore the complexities of ethical leadership. It was, in many ways, a 'crucible' experience. We were stripped of our usual distractions and forced to confront the core of who we are and what we stand for. LeaderShape moves away from the 'command and control' style of leadership and pushes toward a model of <strong>Visionary Leadership</strong>.</p><h4>Living in Possibility</h4><p>A central concept of the institute is 'Living in Possibility.' Most people lead by looking at what is currently wrong and trying to fix it. LeaderShape taught me to look at what *could* be and work backward from there.  We were challenged to create a 'Breakthrough Blueprint'—a vision for the world that doesn't currently exist. This was a turning point for me; I realized that my interest in physics and my passion for leadership weren't separate—they were two sides of the same coin.</p><h4>My Vision: Science Without Borders</h4><p>My vision statement developed at LeaderShape is to <strong>bridge the gap between elite scientific research and rural education</strong>. Coming from a small town, I know firsthand that students in rural areas often lack the resources, mentorship, and equipment found in big cities. My 'Breakthrough' is a future where a student in a town like Comfort has the same access to computational physics tools and mentorship as a student in Austin or San Francisco. Ethical leadership, to me, means using my UTSA education to build those bridges.</p><h4>Integrity and the Ethical Edge</h4><p>We spent a significant amount of time discussing the 'Ethical Edge.' In science, integrity is non-negotiable—data cannot be forged, and results must be reproducible. LeaderShape taught me that leadership requires the same level of <strong>Radical Integrity</strong>. You have to be willing to stand for your values even when it’s unpopular.  We participated in simulations that tested our ability to make hard choices under pressure, teaching me that a leader's character is built in the quiet moments before the crisis hits.</p><h4>The Lasting Impact</h4><p>LeaderShape didn't just give me a certificate; it gave me a community of like-minded 'visionaries.' I left the program with a renewed sense of purpose for my final years at UTSA. I am no longer just studying physics to get a degree; I am studying to gain the tools necessary to fulfill my vision. I feel more equipped to lead research teams, mentor younger students, and advocate for educational reform with a clear, ethical voice.</p>",
            "gradient": "from-indigo-500 to-blue-600",
            "icon": "fas fa-atom"
        }
    ]
}