{
    "entries": [
        {
            "type": "project",
            "title": "Python for Data and Physics",
            "category": "programming",
            "tag": "Python",
            "status": "In Progress",
            "institution": "Self-study / Online",
            "term": "Spring 2026",
            "description": "Learning Python alongside physics courses for data entry, plotting, and simulations.",
            "content": "<h4>Blog Reflection</h4><p>Oh man, learning Python has been such a rollercoaster! I started this to make my physics labs less painful, and let me tell you, the first few hours of staring at error messages made me want to throw my laptop out the window. But then something magical happened — my first working script! Suddenly, all those plots and tables I used to make by hand were just sitting there, clean and perfect. I’ve been diving into NumPy and Matplotlib and even tried automating some repetitive lab calculations — it’s honestly thrilling. I feel like a coding wizard every time a script runs, and I can’t wait to start building mini physics simulations. This is exactly the kind of mix of challenge and fun I live for.</p>",
            "gradient": "from-blue-400 to-green-500",
            "icon": "fas fa-code"
        },
        {
            "type": "project",
            "title": "RYLA Leadership Camp Participation",
            "category": "leadership",
            "tag": "Youth Leadership",
            "status": "Completed",
            "institution": "RYLA",
            "term": "Summer 2024",
            "description": "Attended leadership camp and engaged in teamwork and personal development exercises.",
            "content": "<h4>Blog Reflection</h4><p>RYLA was honestly one of the most eye-opening experiences of my life. The team challenges pushed me way out of my comfort zone, and at first, I wasn’t sure if I’d survive the awkward icebreakers (seriously, why are those so brutal?). But by the end, I felt unstoppable. I learned how to communicate effectively, rally a group, and even see my own strengths in a way I never had before. It was hilarious, exhausting, and inspiring all at once. I left camp thinking, 'Wow, I can actually lead and make an impact' — and that confidence has stuck with me ever since.</p>",
            "gradient": "from-green-300 to-blue-400",
            "icon": "fas fa-users"
        },
        {
            "type": "certificate",
            "title": "Microsoft Python Developer Professional Certificate",
            "category": "career",
            "tag": "Python / Programming",
            "status": "In Progress",
            "institution": "Coursera / Microsoft",
            "term": "2026",
            "description": "Professional certificate in Python development covering programming fundamentals, data analysis, automation, web development, and generative AI.",
            "content": "<h4>Blog Reflection</h4><p>I dove into this Python certificate because I wanted structure and real projects — and wow, it hasn’t disappointed. The hands-on exercises are genuinely fun, and I love the feeling of slowly building a real portfolio piece with each module. Web development with Flask was intimidating at first, but building my first mini app made me feel like a legit developer. I’m especially pumped for the final project where we build a sports data chatbot — it’s like everything I’ve been learning finally clicks together. It’s challenging, yes, but every hurdle I cross is insanely satisfying. I can’t wait to show this off in my portfolio!</p>",
            "gradient": "from-blue-400 to-teal-500",
            "icon": "fas fa-laptop-code"
        },
        {
            "type": "certificate",
            "title": "Adobe Graphic Designer Professional Certificate",
            "category": "career",
            "tag": "Design / Creativity",
            "status": "In Progress",
            "institution": "Coursera / Adobe",
            "term": "2026",
            "description": "Learn design fundamentals, image editing, generative AI for creatives, and portfolio-ready projects using Adobe tools.",
            "content": "<h4>Blog Reflection</h4><p>This Adobe certificate has been surprisingly addictive. I never thought I’d get so hooked on Photoshop and Illustrator! The AI integration stuff is wild — it feels like having a little helper inside the software making me look better than I deserve. I’ve been messing around with brand kits, logos, and compositing images, and it’s honestly so satisfying to see the designs actually come to life. I can feel my creative confidence growing, and I can’t wait to compile a portfolio that shows off some real flair. Plus, it’s just fun to play with color, shape, and design in a way that makes me nerdy and creative at the same time.</p>",
            "gradient": "from-purple-400 to-pink-500",
            "icon": "fas fa-paint-brush"
        },
        {
            "type": "certificate",
            "title": "Microsoft Public Relations and Communications Associate Professional Certificate",
            "category": "career",
            "tag": "Business / PR",
            "status": "In Progress",
            "institution": "Coursera / Microsoft",
            "term": "2026",
            "description": "Professional certificate for public relations and communications, covering content management, media relations, crisis management, and integrated campaigns.",
            "content": "<h4>Blog Reflection</h4><p>Okay, so this PR certificate has been such a weirdly entertaining challenge for me. I’m totally a STEM person, so diving into communications, media relations, and crisis management is like learning a new language. But the projects are actually really fun — creating a full PR campaign and thinking about stakeholder analysis makes me feel like I’m running my own tiny company. I’ve learned that clear communication is literally everything, and seeing how strategy and creativity come together is eye-opening. I might not end up in PR, but wow, these skills are going to make me way more effective at presenting ideas and working in teams everywhere, from physics labs to student projects.</p>",
            "gradient": "from-yellow-400 to-orange-500",
            "icon": "fas fa-bullhorn"
        }
    ]
}
