{
    "entries": [
        {
            "type": "project",
            "title": "Python for Data and Physics",
            "category": "programming",
            "tag": "Python",
            "status": "In Progress",
            "institution": "Self-study / Online",
            "term": "Spring 2026",
            "description": "Learning Python alongside physics courses for data entry, plotting, and simulations.",
            "content": "<h4>Blog Reflection</h4><p>I've started learning Python alongside my physics coursework to make lab data analysis and plotting way easier. Honestly, it’s been a mix of frustration and excitement — debugging syntax errors is humbling, but once a script runs perfectly, it feels like a superpower. I'm focusing on NumPy and Matplotlib first, and slowly learning to automate repetitive tasks like cleaning datasets. I hope to eventually build small simulations for physics problems I encounter in class, which would be super cool and practical.</p>",
            "gradient": "from-blue-400 to-green-500",
            "icon": "fas fa-code"
        },
        {
            "type": "project",
            "title": "RYLA Leadership Camp Participation",
            "category": "leadership",
            "tag": "Youth Leadership",
            "status": "Completed",
            "institution": "RYLA",
            "term": "Summer 2024",
            "description": "Attended leadership camp and engaged in teamwork and personal development exercises.",
            "content": "<h4>Blog Reflection</h4><p>RYLA was honestly one of the best experiences I've had in high school. The team-building exercises were intense but rewarding. I learned so much about communication, leadership, and even my own limits. I walked away feeling more confident in group situations and more aware of how to motivate and collaborate with others. It’s one of those experiences where you realize leadership is more than just being in charge — it’s about listening, planning, and inspiring others.</p>",
            "gradient": "from-green-300 to-blue-400",
            "icon": "fas fa-users"
        },
        {
            "type": "certificate",
            "title": "Microsoft Python Developer Professional Certificate",
            "category": "career",
            "tag": "Python / Programming",
            "status": "In Progress",
            "institution": "Coursera / Microsoft",
            "term": "2026",
            "description": "Professional certificate in Python development covering programming fundamentals, data analysis, automation, web development, and generative AI.",
            "content": "<h4>Blog Reflection</h4><p>I enrolled in this certificate to level up my Python skills in a structured way. The projects are hands-on, and I really like that it includes web development with Flask. I’m especially excited about the final project where we build a sports data chatbot — it feels like a real-world application of everything I've been learning. It's challenging, but I feel like I'm building a portfolio I can be proud of.</p>",
            "gradient": "from-blue-400 to-teal-500",
            "icon": "fas fa-laptop-code"
        },
        {
            "type": "certificate",
            "title": "Adobe Graphic Designer Professional Certificate",
            "category": "career",
            "tag": "Design / Creativity",
            "status": "In Progress",
            "institution": "Coursera / Adobe",
            "term": "2026",
            "description": "Learn design fundamentals, image editing, generative AI for creatives, and portfolio-ready projects using Adobe tools.",
            "content": "<h4>Blog Reflection</h4><p>This certificate is helping me explore creative skills outside of physics. Learning Photoshop and Illustrator has been surprisingly fun. The AI integration lessons are wild — I never thought I’d be using AI to assist in design projects. I’m enjoying experimenting with brand kits and compositing images. By the end, I hope to have a portfolio that really shows off my creative side.</p>",
            "gradient": "from-purple-400 to-pink-500",
            "icon": "fas fa-paint-brush"
        },
        {
            "type": "certificate",
            "title": "Microsoft Public Relations and Communications Associate Professional Certificate",
            "category": "career",
            "tag": "Business / PR",
            "status": "In Progress",
            "institution": "Coursera / Microsoft",
            "term": "2026",
            "description": "Professional certificate for public relations and communications, covering content management, media relations, crisis management, and integrated campaigns.",
            "content": "<h4>Blog Reflection</h4><p>This program is pushing me outside of my STEM comfort zone. Learning about PR strategies, content creation, and crisis management has been eye-opening. The projects are really practical — I’m learning to create actual campaigns and analyze stakeholders. Even if I don’t go into PR as a career, I feel like these skills will help me communicate better in any field, including physics research and academic presentations.</p>",
            "gradient": "from-yellow-400 to-orange-500",
            "icon": "fas fa-bullhorn"
        }
    ]
}
